/* XTIT: Info Screen text when applying the NUIStyleSheet. */
"applyNUIStyleSheetApplyStepInfoScreenText" = "Zastosowanie NUIStyleSheet.";

/* XTIT: Info Screen text when applying the SAP Mobile Services LogSettings. */
"applySAPcpmsLogSettingsStepInfoScreenText" = "Zastosowanie SAP Mobile Services LogSettings.";

/* XFLD: Text information if the provided credentials were invalid. */
"authenticationFailedMessage" = "Uwierzytelnianie nie powiodło się!";

/* XTIT: Info Screen text before presenting the Basic Authentication view. */
"basicAuthenticationStepInfoScreenText" = "Weryfikacja danych uwierzytelniających.";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"cancelAlertControllerTitleText" = "Czy na pewno anulować proces dodawania?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the restore flow. */
"cancelRestoreAlertControllerTitleText" = "Czy na pewno anulować proces odtwarzania?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the reset passcode flow. */
"cancelResetPasscodeAlertControllerTitleText" = "Czy na pewno chcesz anulować proces resetowania kodu dostępu?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the authentication process. */
"cancelAuthenticationProcessAlertControllerTitleText" = "Czy na pewno chcesz anulować proces uwierzytelniania?";

/* Title of Alert window when asking for confirmation about triggering the reset passcode flow. */
"resetPasscodeAlertControllerTitleText" = "Czy na pewno chcesz zresetować kod dostępu?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the passcode change flow. */
"cancelPasscodeChangeControllerTitleText" = "Czy na pewno anulować proces zmiany kodu dostępu?";

/* XTIT: Title of Alert window when asking for confirmation about reset the application. */
"cancelPasscodeControllerTitleText" = "Czy na pewno chcesz zresetować swoją aplikację?";

/* XTIT: Info Screen text when running the Composite Steps. */
"compositeStepInfoScreenText" = "Złożone kroki.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services ClientResources. */
"downloadSAPcpmsClientResourcesStepInfoScreenText" = "Pobieranie SAP Mobile Services ClientResources.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Destinations. */
"downloadSAPcpmsDestinationsStepInfoScreenText" = "Pobieranie miejsc docelowych SAP Mobile Services.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Settings. */
"downloadSAPcpmsSettingsStepInfoScreenText" = "Pobieranie ustawień SAP Mobile Services.";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID got disabled by passcode policy. */
"fuiFeedbackDisableFaceIDButtonText" = "Kontynuuj";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is disabled by the new passcode policy */
"fuiFeedbackDisableTouchIDButtonText" = "Kontynuuj";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID is enabled by the new passcode policy */
"fuiFeedbackEnableFaceIDButtonText" = "Włącz";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is enabled by the new passcode policy */
"fuiFeedbackEnableTouchIDButtonText" = "Włącz";

/* XTIT: FUIFeedbackScreen headline description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDDetailDescription" = "Następnym razem użyj kodu dostępu, aby się zalogować.";

/* XTIT: FUIFeedbackScreen headline text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDHeadlineDescription" = "Funkcja rozpoznawania twarzy Face ID nie będzie już dostępna";

/* XTIT: FUIFeedbackScreen title text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDTitleText" = "Zmiany polityki";

/* XTIT: FUIFeedbackScreen headline description text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDDetailDescription" = "Następnym razem użyj kodu dostępu, aby się zalogować.";

/* XTIT: FUIFeedbackScreen headline text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDHeadlineDescription" = "Funkcja czytnika Touch ID nie będzie już dostępna";

/* XTIT: FUIFeedbackScreen title text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDTitleText" = "Zmiany polityki";

/* XTIT: FUIFeedbackScreen detail description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDDetailDescription" = "Możesz włączać i wyłączać tę funkcję w dowolnym momencie, po wybraniu opcji Ustawienia.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and face ID is enabled. */
"fuiFeedbackScreenEnableFaceIDHeadlineDescription" = "Funkcja rozpoznawania twarzy Face ID jest teraz dostępna! Dzięki Face ID szybciej uzyskasz dostęp do swoich informacji.";

/* XTIT: FUIFeedbackScreen title text when Face ID is enabled in the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDTitleText" = "Funkcja Face ID";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenEnableTouchIDDetailDescription" = "Możesz włączać i wyłączać tę funkcję w dowolnym momencie, po wybraniu opcji Ustawienia.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and touch ID is enabled. */
"fuiFeedbackScreenEnableTouchIDHeadlineDescription" = "Funkcja czytnika Touch ID jest teraz dostępna! Dzięki Touch ID szybciej uzyskasz dostęp do swoich informacji.";

/* XTIT: FUIFeedbackScreen title text when touchID is enabled by the new passcode policy. */
"fuiFeedbackScreenEnableTouchIDTitleText" = "Funkcja Touch ID";

/* XBUT: Text of button on FUIFeedbackScreen when passcode change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedActionButtonText" = "Kontynuuj";

/* XMSG: FUIFeedbackScreen description when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedDescriptionLabel" = "Utwórz nowy kod dostępu.";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedHeadlineText" = "Polityka dotycząca kodów dostępu uległa zmianie";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedTitleText" = "Zmiany polityki";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndFaceIDDetailDescription" = "Od teraz kod dostępu i funkcja Face ID nie będą wymagane do logowania. \n\n Będzie możliwy bezpośredni dostęp do aplikacji.";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndTouchIDDetailDescription" = "Od teraz kod dostępu i funkcja Touch ID nie będą wymagane do logowania. \n\n Będzie możliwy bezpośredni dostęp do aplikacji.";

/* XBUT: Text of button on FUIFeedbackScreen when the passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeButtonText" = "OK";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeDetailDescription" = "Od teraz kod dostępu nie będzie wymagany do logowania. \n\n Będzie możliwy bezpośredni dostęp do aplikacji.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeHeadlineDescription" = "Polityka logowania zmieniła się";

/* XTIT: FUIFeedbackScreen title text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeTitleText" = "Uwaga";

/* XBUT: Text of button on FUIFeedbackScreen after migration when passcode creation is mandatory. */
"migrationOnlyBiometricIDWasSetPreviouslyButtonText" = "Kontynuuj";

/* XTIT: Description of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyDescriptionText" = "Od niniejszej wersji kod dostępu jest obowiązkowy. Utwórz kod dostępu dla aplikacji.";

/* XTIT: Title of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyHeadlineText" = "Kod dostępu jest obowiązkowy";

/* XBUT: Text of No button. */
"noButtonText" = "Nie";

/* XTIT: Info Screen text before presenting the OAuth2 Authentication view. */
"oauth2AuthenticationStepInfoScreenText" = "Weryfikacja danych uwierzytelniających OAuth 2.0.";

/* XTIT: Text of PasscodeInputController when user wants to enable face ID. */
"passcodeInputControllerEnableFaceIDText" = "Aby włączyć funkcję Face ID, wprowadź swój kod dostępu:";

/* XTIT: Text of PasscodeInputController when user wants to enable touch ID. */
"passcodeInputControllerEnableTouchIDText" = "Aby włączyć funkcję Touch ID, wprowadź dwój kod dostępu:";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"rejectAlertControllerTitleText" = "Bez wyrażenia zgody kontynuacja dodawania nie będzie możliwa.";

/* XBUT: Text of No button of reject. */
"rejectNoButtonText" = "Udziel zgody";

/* XBUT: Text of Yes button of reject. */
"rejectYesButtonText" = "Zakończ proces";

/* XTIT: Info Screen text before presenting the SAML Authentication view. */
"samlAuthenticationStepInfoScreenText" = "Weryfikacja danych uwierzytelniających SAML.";

/* XTIT: Info Screen text before presenting the SAP Mobile Services UserIdentity Discovery Authentication view. */
"sapcpmsUserIdentityDiscoveryAuthenticationStepInfoScreenText" = "Weryfikacja danych uwierzytelniających SAP Mobile Services UserIdentity Discovery.";

/* XTIT: Info Screen text before presenting the SLS Authentication view. */
"slsAuthenticationStepInfoScreenText" = "Weryfikacja danych uwierzytelniających SLS.";

/* XMSG: Message for the user to fill all the fields for authentication. */
"slsFillAllOfTheFieldsErrorMessage" = "Wypełnij wszystkie pola";

/* XBUT: Text of Yes button. */
"yesButtonText" = "Tak";

/* XBUT: Text of Continue button. */
"continueButtonText" = "Kontynuuj";

/* XBUT: Text of Cancel button. */
"cancelButtonText" = "Anuluj";

/* XTIT: Title of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentTitle" = "Gromadzenie danych dotyczących użytkowania";

/* XTIT: Body of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentBody" = "Administrator aplikacji prosi Cię o wyrażenie zgody na gromadzenie danych dotyczących korzystania z aplikacji w celu zebrania opinii, które pozwolą na ulepszenie aplikacji. Gromadzenie danych obejmuje pozyskiwanie informacji na temat użytkowania aplikacji, takich jak czas poświęcony na korzystanie z aplikacji lub sposób nawigacji w ramach aplikacji.";

/* XTIT: Usage Collection Consent opt-out alert message. */
"usageOptOutAlertMessage" = "Rezygnujesz?";

/* XTIT: Usage Collection Consent opt-in alert message. */
"usageOptInAlertMessage" = "Wyrażasz zgodę?";

/* XTIT: Title of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentTitle" = "Gromadzenie raportów o awarii";

/* XTIT: Body of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentBody" = "Administrator aplikacji prosi Cię o wyrażenie zgody na gromadzenie danych na potrzeby diagnozy i analizy awarii aplikacji celem poprawienia jej stabilności. Gromadzone dane ograniczają się do raportów o awariach oraz informacji o urządzeniu.";

/* XTIT: Title of alert to be shown when QR Digital Signature Verification fails. */
"qrDigitalSignatureVerficationFailedTitle" = "Niepowodzenie!";

/* \"XMSG: Message telling that the QR Digital Signature Verification failed.\" */
"qrDigitalSignatureVerficationFailedMessage" = "Weryfikacja podpisu kodu QR nie powiodła się!";

/* \"XMSG: Message telling that the QR code signature verification succeeded.\" */
"qrDigitalSignatureVerficationSucceededMessage" = "Zweryfikowano podpis cyfrowy kodu QR. Zostaniesz połączony z:";

/* \"XTIT: Title of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorTitle" = "Błąd uwierzytelniania";

/* \"XMSG: Message of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorMessage" = "Nie mogliśmy Cię uwierzytelnić. Zarejestruj się.";

/* \"XBUT: Text of Error button.\" */
"errorButtonText" = "Błąd";

